<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Document</title>

    
    <style>

        .next-btn {
  background-color: #3498db; /* Background color */
  border: none; /* Remove border */
  color: white; /* Text color */
  padding: 10px 20px; /* Padding */
  text-align: center; /* Center text */
  text-decoration: none; /* Remove underline */
  display: inline-block;
  font-size: 16px; /* Font size */
  cursor: pointer; /* Cursor style */
  border-radius: 5px; /* Rounded corners */
 
 }

    </style>

</head>
<body>

    <?php
    $hadithCollection = [

        [ 'আনাস ইবনু মালিক (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মদিনা এখান হতে ওখান পর্যন্ত হারাম (রূপে গণ্য)। সুতরাং তার গাছ কাটা যাবে না এবং এখানে কোন ধরনের অঘটন (বিদ‘আত, অত্যাচার ইত্যাদি) ঘটানো যাবে না। যদি কেউ এখানে কোন অঘটন ঘটায় তাহলে তার প্রতি আল্লাহ্‌র এবং ফেরেশতাদের ও সকল মানুষের লা’নত (অভিশাপ)। ','সহীহ বুখারী'],
        ['আনাস (রাঃ) হতে বর্ণিত। তিনি বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম মাদ্বীনায় এসে মাসজিদ নির্মাণের আদেশ দেন। অতঃপর বলেনঃ হে বনূ নাজ্জার! আমার নিকট হতে মূল্য নিয়ে (ভূমি) বিক্রি কর। তাঁরা বললেন, আমরা এর মূল্য কেবল আল্লাহর নিকটই চাই। এরপর নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম -এর নির্দেশে মুশরিকদের কবর খুঁড়ে ফেলা হল, ধ্বংসাবশেষ সমতল করা হল, খেজুর গাছগুলো কেটে ফেলা হল। কেবল মসজিদের কিবলার দিকে কিছু খেজুর গাছ সারিবদ্ধভাবে রাখা হল। ', 'সহীহ বুখারী'],
        ['আবূ হুরাইরাহ্ (রাঃ) হতে বর্ণিত যে, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ মাদ্বীনার দু’ পাথুরে ভূমির মধ্যবর্তী স্থান আমার ঘোষণা মোতাবেক হারাম হিসাবে নির্ধারিত করা হয়েছে। বর্ণনাকারী বলেন, নবী সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বনূ হারিসের নিকট তাশরীফ আনেন এবং বলেনঃ হে বনূ হারিসা! আমার ধারণা ছিল যে, তোমরা হারামের বাইরে অবস্থান করছ, অতঃপর তিনি সেদিকে দৃষ্টিপাত করে বললেনঃ (না তোমরা হারামের বাইরে নও) বরং তোমরা হারামের ভিতরেই আছ।', 'সহীহ বুখারী'],

        ['আবূ সালামাহ (রাঃ) থেকে বর্ণিত। আবূ হুরায়রা (রাঃ) এক ব্যাক্তিকে (ইবনু আব্বাসকে) বলেন, হে ভ্রাতুষ্পুত্র! আমি তোমার নিকট রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম এর হাদীস বর্ণনা করলে তুমি তার বিপরীতে কোন দৃষ্টান্ত পেশ করো না।', 'ইবনে মাজা'],

        ['ইবনু আব্বাস (রাঃ) থেকে বর্ণিত। তিনি বলেন, রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেনঃ একজন ফকীহ (শারীআতের বিধানে অভিজ্ঞ ব্যাক্তি) শয়তানের জন্য এক হাজার ইবাদাতকারীর চেয়ে অধিক শক্ত।

', 'ইবনে মাজা'],

        ['উম্মুল মু’মেনীন উম্মে আব্দুল্লাহ আয়েশা রাদিয়াল্লাহু ’আনহা থেকে বর্ণিত রাসূলুল্লাহ সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম বলেছেন, ’’একটি বাহিনী কা’বা ঘরের উপর আক্রমণ করার উদ্দেশ্যে বের হবে। অতঃপর যখন তারা সমতল মরুপ্রান্তরে (বাইদা) পৌঁছবে তখন তাদের প্রথম ও শেষ ব্যক্তি সকলকেই যমীনে ধসিয়ে দেওয়া হবে। তিনি (আয়েশা) বলেন যে, আমি (এ কথা শুনে) বললাম, হে আল্লাহর রাসূল! কেমন করে তাদের প্রথম ও শেষ সকলকে ধসিয়ে দেওয়া হবে? অথচ তাদের মধ্যে তাদের বাজারের ব্যবসায়ী এবং এমন লোক থাকবে, যারা তাদের (আক্রমণকারীদের) অন্তর্ভুক্ত নয়। তিনি বললেন, তাদের প্রথম ও শেষ সকলকে ধসিয়ে দেওয়া হবে। তারপর তাদেরকে তাদের নিয়ত অনুযায়ী পুনরুত্থিত করা হবে।

', 'সহীহ মুসলিম'],

    ];
    $totalHadith = count($hadithCollection) - 1;
    $randNum = rand(0, $totalHadith);
    $hadith =  $hadithCollection[$randNum][0];
    $book = $hadithCollection[$randNum][1];
    ?>
    <div style="width: 50%; height: 40%; background: #f0f0f0; text-align:center; padding:3% 5%;   margin:auto; border-radius: 15px;">
    <p ><?php echo $hadith .'<br><br>' ; ?></p>

    <h3 style="text-align: right;"><?php echo '~ '. $book; ?></h3>
    <form action="#" method="post">
        <button type="submit" class="next-btn">Next</button>
    </form>

    </div>
</body>
</html>
